# Pandas

## Install requirements

In [1]:
pip install -r requirements.txt

Requirement already satisfied: anyio==3.6.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 1)) (3.6.2)
Requirement already satisfied: argon2-cffi==21.3.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 2)) (21.3.0)
Requirement already satisfied: argon2-cffi-bindings==21.2.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 3)) (21.2.0)
Requirement already satisfied: arrow==1.2.3 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 4)) (1.2.3)
Requirement already satisfied: asttokens==2.2.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 5)) (2.2.1)
Requirement already satisfied: attrs==22.2.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 6)) (22.2.0)
Requirement already satisfied: autopep8==2.0.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 7)) (2.0.1)
Requirement already satisfied: backcall==0.2.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 8)) (0.2.0)
Requirement already satisfied: beautifulsoup4==4.11.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 9)) (4.11.1)
Requirement already satisfied: bleach==5.0.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 10)) (5.0.1)
Requirement already satisfied: cffi==1.15.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 11)) (1.15.1)
Requirement already satisfied: comm==0.1.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 12)) (0.1.2)
Requirement already satisfied: debugpy==1.6.5 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 13)) (1.6.5)
Requirement already satisfied: decorator==5.1.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 14)) (5.1.1)
Requirement already satisfied: defusedxml==0.7.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 15)) (0.7.1)
Requirement already satisfied: entrypoints==0.4 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 16)) (0.4)
Requirement already satisfied: executing==1.2.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 17)) (1.2.0)
Requirement already satisfied: fastjsonschema==2.16.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 18)) (2.16.2)
Requirement already satisfied: fqdn==1.5.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 19)) (1.5.1)
Requirement already satisfied: idna==3.4 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 20)) (3.4)
Requirement already satisfied: ipykernel==6.20.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 21)) (6.20.1)
Requirement already satisfied: ipython==8.8.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 22)) (8.8.0)
Requirement already satisfied: ipython-genutils==0.2.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 23)) (0.2.0)
Requirement already satisfied: isoduration==20.11.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 24)) (20.11.0)
Requirement already satisfied: jedi==0.18.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 25)) (0.18.2)
Requirement already satisfied: Jinja2==3.1.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 26)) (3.1.2)
Requirement already satisfied: jsonpointer==2.3 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 27)) (2.3)
Requirement already satisfied: jsonschema==4.17.3 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 28)) (4.17.3)
Requirement already satisfied: jupyter-events==0.6.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 29)) (0.6.2)
Requirement already satisfied: jupyter_client==7.4.8 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 30)) (7.4.8)
Requirement already satisfied: jupyter_core==5.1.3 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 31)) (5.1.3)
Requirement already satisfied: jupyter_server==2.0.6 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 32)) (2.0.6)
Requirement already satisfied: jupyter_server_terminals==0.4.4 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 33)) (0.4.4)
Requirement already satisfied: jupyterlab-pygments==0.2.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 34)) (0.2.2)
Requirement already satisfied: MarkupSafe==2.1.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 35)) (2.1.1)
Requirement already satisfied: matplotlib-inline==0.1.6 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 36)) (0.1.6)
Requirement already satisfied: mistune==2.0.4 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 37)) (2.0.4)
Requirement already satisfied: nbclassic==0.4.8 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 38)) (0.4.8)
Requirement already satisfied: nbclient==0.7.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 39)) (0.7.2)
Requirement already satisfied: nbconvert==7.2.7 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 40)) (7.2.7)
Requirement already satisfied: nbformat==5.7.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 41)) (5.7.2)
Requirement already satisfied: nest-asyncio==1.5.6 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 42)) (1.5.6)
Requirement already satisfied: notebook==6.5.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 43)) (6.5.2)
Requirement already satisfied: notebook_shim==0.2.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 44)) (0.2.2)
Requirement already satisfied: numpy==1.24.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 45)) (1.24.1)
Requirement already satisfied: packaging==23.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 46)) (23.0)
Requirement already satisfied: pandas==1.5.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 47)) (1.5.2)
Requirement already satisfied: pandocfilters==1.5.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 48)) (1.5.0)
Requirement already satisfied: parso==0.8.3 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 49)) (0.8.3)
Requirement already satisfied: pexpect==4.8.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 50)) (4.8.0)
Requirement already satisfied: pickleshare==0.7.5 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 51)) (0.7.5)
Requirement already satisfied: platformdirs==2.6.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 52)) (2.6.2)
Requirement already satisfied: prometheus-client==0.15.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 53)) (0.15.0)
Requirement already satisfied: prompt-toolkit==3.0.36 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 54)) (3.0.36)
Requirement already satisfied: psutil==5.9.4 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 55)) (5.9.4)
Requirement already satisfied: ptyprocess==0.7.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 56)) (0.7.0)
Requirement already satisfied: pure-eval==0.2.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 57)) (0.2.2)
Requirement already satisfied: pycodestyle==2.10.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 58)) (2.10.0)
Requirement already satisfied: pycparser==2.21 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 59)) (2.21)
Requirement already satisfied: Pygments==2.14.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 60)) (2.14.0)
Requirement already satisfied: pyrsistent==0.19.3 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 61)) (0.19.3)
Requirement already satisfied: python-dateutil==2.8.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 62)) (2.8.2)
Requirement already satisfied: python-json-logger==2.0.4 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 63)) (2.0.4)
Requirement already satisfied: pytz==2022.7.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 64)) (2022.7.1)
Requirement already satisfied: PyYAML==6.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 65)) (6.0)
Requirement already satisfied: pyzmq==24.0.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 66)) (24.0.1)
Requirement already satisfied: rfc3339-validator==0.1.4 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 67)) (0.1.4)
Requirement already satisfied: rfc3986-validator==0.1.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 68)) (0.1.1)
Requirement already satisfied: Send2Trash==1.8.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 69)) (1.8.0)
Requirement already satisfied: six==1.16.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 70)) (1.16.0)
Requirement already satisfied: sniffio==1.3.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 71)) (1.3.0)
Requirement already satisfied: soupsieve==2.3.2.post1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 72)) (2.3.2.post1)
Requirement already satisfied: stack-data==0.6.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 73)) (0.6.2)
Requirement already satisfied: terminado==0.17.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 74)) (0.17.1)
Requirement already satisfied: tinycss2==1.2.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 75)) (1.2.1)
Requirement already satisfied: tomli==2.0.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 76)) (2.0.1)
Requirement already satisfied: tornado==6.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 77)) (6.2)
Requirement already satisfied: traitlets==5.8.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 78)) (5.8.1)
Requirement already satisfied: uri-template==1.2.0 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 79)) (1.2.0)
Requirement already satisfied: wcwidth==0.2.5 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 80)) (0.2.5)
Requirement already satisfied: webcolors==1.12 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 81)) (1.12)
Requirement already satisfied: webencodings==0.5.1 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 82)) (0.5.1)
Requirement already satisfied: websocket-client==1.4.2 in ./venv/lib/python3.10/site-packages (from -r requirements.txt (line 83)) (1.4.2)
Note: you may need to restart the kernel to use updated packages.

## Import Pandas

In [2]:
import pandas as pd

## Read CSV of universities rankings

In [3]:
ds = pd.read_csv('datasets/universites_rankings.csv')

## Read first 5 rows of dataframe / dataset

In [4]:
ds.head()

,Year,Rank,Name,Point,City,Country
0,2018,1,Harvard University,97.7,Cambridge,United States
1,2018,2,University of Cambridge,94.6,Cambridge,United Kingdom
2,2018,2,University of Oxford,94.6,Oxford,United Kingdom
3,2018,4,Massachusetts Institute of Technology (MIT),92.5,Cambridge,United States
4,2018,5,Johns Hopkins University,92.1,Baltimore,United States

## Read last 5 rows of dataframe / dataset

In [5]:
ds.tail()

,Year,Rank,Name,Point,City,Country
5245,2022,346,National Cheng Kung University (NCKU),60.7,Tainan City,Taiwan
5246,2022,346,University of New Mexico,60.7,Albuquerque,United States
5247,2022,348,Universitas Indonesia,60.6,Depok,Indonesia
5248,2022,349,Aga Khan University,60.5,Karachi,Pakistan
5249,2022,349,Northeastern University,60.5,Boston,United States

## Create own dataset

In [6]:
cdf = pd.DataFrame({
    'id': [1, 2, 3, 4, 5],
    'name': ['Haroon Mahmood', 'Madiha Hussain', 'Ali', 'Noor', 'Alex'],
    'profession': ['Software Engineer', 'Future Doctor', 'Wordpress Developer', 'SQA Engineer', 'Tiktoker']
})

In [7]:
cdf.head()

   id            name           profession
0   1  Haroon Mahmood    Software Engineer
1   2  Madiha Hussain        Future Doctor
2   3             Ali  Wordpress Developer
3   4            Noor         SQA Engineer
4   5            Alex             Tiktoker

## Describe dataset like count, mean, std, etc

In [8]:
ds.describe()

              Year         Rank        Point
count  5250.000000  5250.000000  5030.000000
mean   2020.666667   174.803429    70.840040
std       1.247338   100.807265     8.128413
min    2018.000000     1.000000    57.500000
25%    2020.000000    88.000000    64.500000
50%    2021.000000   175.000000    69.100000
75%    2022.000000   262.000000    76.000000
max    2022.000000   350.000000    99.000000

In [9]:
ds.Year.describe()

count    5250.000000
mean     2020.666667
std         1.247338
min      2018.000000
25%      2020.000000
50%      2021.000000
75%      2022.000000
max      2022.000000
Name: Year, dtype: float64

## Find unique values from dataset for specific column

In [10]:
ds.Year.unique()

array([2018, 2019, 2020, 2021, 2022])

In [11]:
ds.Year.dtype

dtype('int64')

In [12]:
ds.dtypes

Year         int64
Rank         int64
Name        object
Point      float64
City        object
Country     object
dtype: object

## Find Missing / Null Values from Dataframe

In [13]:
ds.isnull().sum()

Year         0
Rank         0
Name         0
Point      220
City         0
Country      1
dtype: int64

### Drop null values column wise

In [77]:
ds.dropna(inplace=True, axis=1)
ds.isnull().sum()

Year    0
Rank    0
Name    0
City    0
dtype: int64

### Drop null values row wise

In [14]:
ds.dropna(inplace=True, axis=0)
ds.isnull().sum()

Year       0
Rank       0
Name       0
Point      0
City       0
Country    0
dtype: int64

In [15]:
ds.head()

,Year,Rank,Name,Point,City,Country
0,2018,1,Harvard University,97.7,Cambridge,United States
1,2018,2,University of Cambridge,94.6,Cambridge,United Kingdom
2,2018,2,University of Oxford,94.6,Oxford,United Kingdom
3,2018,4,Massachusetts Institute of Technology (MIT),92.5,Cambridge,United States
4,2018,5,Johns Hopkins University,92.1,Baltimore,United States

In [16]:
ds.shape

(5029, 6)

### Fill the null values with something

In [17]:
ds.fillna(0, inplace=True)

In [18]:
ds.columns

Index(['Year', 'Rank', 'Name', 'Point', 'City', 'Country'], dtype='object')

## Pandas Indexing

In [20]:
ds[['Year']].head()

   Year
0  2018
1  2018
2  2018
3  2018
4  2018

In [21]:
ds[['Year', 'Rank', 'Name']]

      Year  Rank                                         Name
0     2018     1                           Harvard University
1     2018     2                      University of Cambridge
2     2018     2                         University of Oxford
3     2018     4  Massachusetts Institute of Technology (MIT)
4     2018     5                     Johns Hopkins University
...    ...   ...                                          ...
5245  2022   346        National Cheng Kung University (NCKU)
5246  2022   346                     University of New Mexico
5247  2022   348                        Universitas Indonesia
5248  2022   349                          Aga Khan University
5249  2022   349                      Northeastern University

[5029 rows x 3 columns]

In [24]:
ds.iloc[555:]

,Year,Rank,Name,Point,City,Country
579,2019,229,University of Naples - Federico II,64.5,Naples,Italy
580,2019,231,Tel Aviv University,64.4,Tel Aviv,Israel
581,2019,231,University at Buffalo SUNY,64.4,Buffalo,United States
582,2019,233,The University of Warwick,64.3,Coventry,United Kingdom
583,2019,234,Universiti Sains Malaysia (USM),64.1,Gelugor,Malaysia
...,...,...,...,...,...,...
5245,2022,346,National Cheng Kung University (NCKU),60.7,Tainan City,Taiwan
5246,2022,346,University of New Mexico,60.7,Albuquerque,United States
5247,2022,348,Universitas Indonesia,60.6,Depok,Indonesia
5248,2022,349,Aga Khan University,60.5,Karachi,Pakistan
5249,2022,349,Northeastern University,60.5,Boston,United States

In [27]:
ds.loc[ds['City'] == 'Lahore'].count()

Year       0
Rank       0
Name       0
Point      0
City       0
Country    0
dtype: int64